---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Lighting.CircleLightShape
source: html/3fd6eeca-a2a5-2043-9a9a-dc1ec0f7c4cb.htm
---
# CircleLightShape Members

Creates a circle light shape object with 2.0' emit diameter.